In [6]:
%load_ext sql
%sql postgresql://admin:admin@db:5432/company

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Connecting and switching to connection 'postgresql://admin:***@db:5432/company'

#### Here's the sql code to create a table for the assignment:

In [ ]:
%%sql
-- Drop the table if it already exists
DROP TABLE IF EXISTS humans;

-- Create the humans table
CREATE TABLE IF NOT EXISTS humans (
  human_id SERIAL PRIMARY KEY,
    first_name VARCHAR(50) NOT NULL,
    last_name VARCHAR(50) NOT NULL,
    department VARCHAR(50),
    salary DECIMAL(10, 2) CHECK(salary > 0),
    joining_date DATE NOT NULL,
    age INT CHECK(age >= 18)
);

#### Insert some sample data into `humans` table:

In [ ]:
%%sql
-- Insert data into human table
INSERT INTO humans (first_name, last_name, department, salary, joining_date, age)
VALUES 
    ('Amit', 'Sharma', 'IT', 60000.00, '2022-05-01', 29), 
    ('Neha', 'Patel', 'HR', 55000.00, '2021-08-15', 32),
    ('Ravi', 'Kumar', 'Finance', 70000.00, '2020-03-10', 35),
    ('Anjali', 'Verma', 'IT', 65000.00, '2019-11-22', 28),
    ('Suresh', 'Reddy', 'Operations', 50000.00, '2023-01-10', 26);

#### Practice Assignment Questions with Answers (Solution has given below after the questions)

1. Retrieve all humans first_name and their department.
2. Update the salary of all humans in the `IT` department by increasing it by 10%
3. Delete all humans who are older than 34 years.
4. Add a new column `email` to the `humans` table.
5. Rename the `department` column to `dept_name`.
6. Retrieve the names of humans who joined after January 1, 2021.
7. Change the data type of the `salary` column to `INTEGER`
8. List all humans with their age and salary in descending order of salary.
9. Insert a new alien with the following details: 'Raj', 'Singh', 'Marketing', 60000, '2023-09-15', 30.
10. Update age of humans +1 to every humans

In [7]:
%%sql
-- Drop the table if it already exists
DROP TABLE IF EXISTS humans;

-- Create the humans table
CREATE TABLE IF NOT EXISTS humans (
  human_id SERIAL PRIMARY KEY,
    first_name VARCHAR(50) NOT NULL,
    last_name VARCHAR(50) NOT NULL,
    department VARCHAR(50),
    salary DECIMAL(10, 2) CHECK(salary > 0),
    joining_date DATE NOT NULL,
    age INT CHECK(age >= 18)
);

Running query in 'postgresql://admin:***@db:5432/company'

++
||
++
++

In [8]:
%%sql
-- Insert data into humans table
INSERT INTO humans (first_name, last_name, department, salary, joining_date, age)
VALUES 
    ('Amit', 'Sharma', 'IT', 60000.00, '2022-05-01', 29), 
    ('Neha', 'Patel', 'HR', 55000.00, '2021-08-15', 32),
    ('Ravi', 'Kumar', 'Finance', 70000.00, '2020-03-10', 35),
    ('Anjali', 'Verma', 'IT', 65000.00, '2019-11-22', 28),
    ('Suresh', 'Reddy', 'Operations', 50000.00, '2023-01-10', 26);

Running query in 'postgresql://admin:***@db:5432/company'

5 rows affected.

++
||
++
++

In [9]:
%%sql
select * from humans;

Running query in 'postgresql://admin:***@db:5432/company'

5 rows affected.

+----------+------------+-----------+------------+----------+--------------+-----+
| human_id | first_name | last_name | department |  salary  | joining_date | age |
+----------+------------+-----------+------------+----------+--------------+-----+
|    1     |    Amit    |   Sharma  |     IT     | 60000.00 |  2022-05-01  |  29 |
|    2     |    Neha    |   Patel   |     HR     | 55000.00 |  2021-08-15  |  32 |
|    3     |    Ravi    |   Kumar   |  Finance   | 70000.00 |  2020-03-10  |  35 |
|    4     |   Anjali   |   Verma   |     IT     | 65000.00 |  2019-11-22  |  28 |
|    5     |   Suresh   |   Reddy   | Operations | 50000.00 |  2023-01-10  |  26 |
+----------+------------+-----------+------------+----------+--------------+-----+

## Solutions

1. Retrieve all humans first_name and their department.

In [12]:
%%sql
select first_name, department from humans;

Running query in 'postgresql://admin:***@db:5432/company'

5 rows affected.

+------------+------------+
| first_name | department |
+------------+------------+
|    Amit    |     IT     |
|    Neha    |     HR     |
|    Ravi    |  Finance   |
|   Anjali   |     IT     |
|   Suresh   | Operations |
+------------+------------+

2. Update the salary of all humans in the `IT` department by increasing it by 10%

In [13]:
%%sql
UPDATE humans
SET salary=salary+salary*.10
WHERE department='IT'

Running query in 'postgresql://admin:***@db:5432/company'

2 rows affected.

++
||
++
++

In [14]:
%%sql
SELECT * FROM humans;

Running query in 'postgresql://admin:***@db:5432/company'

5 rows affected.

+----------+------------+-----------+------------+----------+--------------+-----+
| human_id | first_name | last_name | department |  salary  | joining_date | age |
+----------+------------+-----------+------------+----------+--------------+-----+
|    2     |    Neha    |   Patel   |     HR     | 55000.00 |  2021-08-15  |  32 |
|    3     |    Ravi    |   Kumar   |  Finance   | 70000.00 |  2020-03-10  |  35 |
|    5     |   Suresh   |   Reddy   | Operations | 50000.00 |  2023-01-10  |  26 |
|    1     |    Amit    |   Sharma  |     IT     | 66000.00 |  2022-05-01  |  29 |
|    4     |   Anjali   |   Verma   |     IT     | 71500.00 |  2019-11-22  |  28 |
+----------+------------+-----------+------------+----------+--------------+-----+

3. Delete all humans who are older than 34 years.

In [16]:
%%sql
DELETE FROM humans
WHERE age > 34;

Running query in 'postgresql://admin:***@db:5432/company'

1 rows affected.

++
||
++
++

In [17]:
%%sql
SELECT * FROM humans;

Running query in 'postgresql://admin:***@db:5432/company'

4 rows affected.

+----------+------------+-----------+------------+----------+--------------+-----+
| human_id | first_name | last_name | department |  salary  | joining_date | age |
+----------+------------+-----------+------------+----------+--------------+-----+
|    2     |    Neha    |   Patel   |     HR     | 55000.00 |  2021-08-15  |  32 |
|    5     |   Suresh   |   Reddy   | Operations | 50000.00 |  2023-01-10  |  26 |
|    1     |    Amit    |   Sharma  |     IT     | 66000.00 |  2022-05-01  |  29 |
|    4     |   Anjali   |   Verma   |     IT     | 71500.00 |  2019-11-22  |  28 |
+----------+------------+-----------+------------+----------+--------------+-----+

4. Add a new column `email` to the `humans` table.

In [21]:
%%sql
ALTER TABLE humans
ADD COLUMN email VARCHAR(50);

Running query in 'postgresql://admin:***@db:5432/company'

++
||
++
++

In [22]:
%%sql
SELECT * FROM humans;

Running query in 'postgresql://admin:***@db:5432/company'

4 rows affected.

+----------+------------+-----------+------------+----------+--------------+-----+-------+
| human_id | first_name | last_name | department |  salary  | joining_date | age | email |
+----------+------------+-----------+------------+----------+--------------+-----+-------+
|    2     |    Neha    |   Patel   |     HR     | 55000.00 |  2021-08-15  |  32 |  None |
|    5     |   Suresh   |   Reddy   | Operations | 50000.00 |  2023-01-10  |  26 |  None |
|    1     |    Amit    |   Sharma  |     IT     | 66000.00 |  2022-05-01  |  29 |  None |
|    4     |   Anjali   |   Verma   |     IT     | 71500.00 |  2019-11-22  |  28 |  None |
+----------+------------+-----------+------------+----------+--------------+-----+-------+

5. Rename the department column to dept_name.

In [23]:
%%sql
ALTER TABLE humans
RENAME COLUMN department TO dept_name;

Running query in 'postgresql://admin:***@db:5432/company'

++
||
++
++

In [24]:
%%sql
SELECT * FROM humans;

Running query in 'postgresql://admin:***@db:5432/company'

4 rows affected.

+----------+------------+-----------+------------+----------+--------------+-----+-------+
| human_id | first_name | last_name | dept_name  |  salary  | joining_date | age | email |
+----------+------------+-----------+------------+----------+--------------+-----+-------+
|    2     |    Neha    |   Patel   |     HR     | 55000.00 |  2021-08-15  |  32 |  None |
|    5     |   Suresh   |   Reddy   | Operations | 50000.00 |  2023-01-10  |  26 |  None |
|    1     |    Amit    |   Sharma  |     IT     | 66000.00 |  2022-05-01  |  29 |  None |
|    4     |   Anjali   |   Verma   |     IT     | 71500.00 |  2019-11-22  |  28 |  None |
+----------+------------+-----------+------------+----------+--------------+-----+-------+

6. Retrieve the names of humans who joined after January 1, 2021.

In [41]:
%%sql
SELECT first_name, last_name, joining_date FROM humans
WHERE joining_date > '2021-01-01 00:00:00';
-- WHERE joining_date > '2021-01-01 00:00:00'; -- works too

Running query in 'postgresql://admin:***@db:5432/company'

4 rows affected.

+------------+-----------+--------------+
| first_name | last_name | joining_date |
+------------+-----------+--------------+
|    Neha    |   Patel   |  2021-08-15  |
|   Suresh   |   Reddy   |  2023-01-10  |
|    Amit    |   Sharma  |  2022-05-01  |
|    Raj     |   Singh   |  2023-09-15  |
+------------+-----------+--------------+

7. Change the data type of the `salary` column to `INTEGER`

In [42]:
%%sql
ALTER TABLE humans
ALTER COLUMN salary TYPE INTEGER;
-- ALTER COLUM salary TYPE INTEGER USING salary::INTEGER

Running query in 'postgresql://admin:***@db:5432/company'

++
||
++
++

In [43]:
%%sql
SELECT * FROM humans;

Running query in 'postgresql://admin:***@db:5432/company'

5 rows affected.

+----------+------------+-----------+------------+--------+--------------+-----+---------------------+
| human_id | first_name | last_name | dept_name  | salary | joining_date | age |        email        |
+----------+------------+-----------+------------+--------+--------------+-----+---------------------+
|    2     |    Neha    |   Patel   |     HR     | 55000  |  2021-08-15  |  33 |         None        |
|    5     |   Suresh   |   Reddy   | Operations | 50000  |  2023-01-10  |  27 |         None        |
|    1     |    Amit    |   Sharma  |     IT     | 66000  |  2022-05-01  |  30 |         None        |
|    4     |   Anjali   |   Verma   |     IT     | 71500  |  2019-11-22  |  29 |         None        |
|    6     |    Raj     |   Singh   | Marketing  | 60000  |  2023-09-15  |  31 | singh.raj@gmail.com |
+----------+------------+-----------+------------+--------+--------------+-----+---------------------+

8. List all humans with their age and salary in descending order of salary.

In [44]:
%%sql
SELECT first_name, age, salary FROM humans
ORDER BY salary DESC;

Running query in 'postgresql://admin:***@db:5432/company'

5 rows affected.

+------------+-----+--------+
| first_name | age | salary |
+------------+-----+--------+
|   Anjali   |  29 | 71500  |
|    Amit    |  30 | 66000  |
|    Raj     |  31 | 60000  |
|    Neha    |  33 | 55000  |
|   Suresh   |  27 | 50000  |
+------------+-----+--------+

9. Insert a new alien with the following details: 'Raj', 'Singh', 'Marketing', 60000, '2023-09-15', 30.

In [36]:
%%sql
INSERT INTO humans(first_name, last_name, dept_name, salary, joining_date, age, email)
VALUES ('Raj', 'Singh', 'Marketing', 60000, '2023-09-15', 30, 'singh.raj@gmail.com');

Running query in 'postgresql://admin:***@db:5432/company'

1 rows affected.

++
||
++
++

In [37]:
%%sql
SELECT * FROM humans;

Running query in 'postgresql://admin:***@db:5432/company'

5 rows affected.

+----------+------------+-----------+------------+--------+--------------+-----+---------------------+
| human_id | first_name | last_name | dept_name  | salary | joining_date | age |        email        |
+----------+------------+-----------+------------+--------+--------------+-----+---------------------+
|    2     |    Neha    |   Patel   |     HR     | 55000  |  2021-08-15  |  32 |         None        |
|    5     |   Suresh   |   Reddy   | Operations | 50000  |  2023-01-10  |  26 |         None        |
|    1     |    Amit    |   Sharma  |     IT     | 66000  |  2022-05-01  |  29 |         None        |
|    4     |   Anjali   |   Verma   |     IT     | 71500  |  2019-11-22  |  28 |         None        |
|    6     |    Raj     |   Singh   | Marketing  | 60000  |  2023-09-15  |  30 | singh.raj@gmail.com |
+----------+------------+-----------+------------+--------+--------------+-----+---------------------+

10. Update age of humans +1 to every humans

In [38]:
%%sql
UPDATE humans
SET age=age+1

Running query in 'postgresql://admin:***@db:5432/company'

5 rows affected.

++
||
++
++

In [39]:
%%sql
SELECT * FROM humans;

Running query in 'postgresql://admin:***@db:5432/company'

5 rows affected.

+----------+------------+-----------+------------+--------+--------------+-----+---------------------+
| human_id | first_name | last_name | dept_name  | salary | joining_date | age |        email        |
+----------+------------+-----------+------------+--------+--------------+-----+---------------------+
|    2     |    Neha    |   Patel   |     HR     | 55000  |  2021-08-15  |  33 |         None        |
|    5     |   Suresh   |   Reddy   | Operations | 50000  |  2023-01-10  |  27 |         None        |
|    1     |    Amit    |   Sharma  |     IT     | 66000  |  2022-05-01  |  30 |         None        |
|    4     |   Anjali   |   Verma   |     IT     | 71500  |  2019-11-22  |  29 |         None        |
|    6     |    Raj     |   Singh   | Marketing  | 60000  |  2023-09-15  |  31 | singh.raj@gmail.com |
+----------+------------+-----------+------------+--------+--------------+-----+---------------------+